#### Terraform Format and Style 🖌

<details><summary>Show Formatted Files</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖 
Warning: Argument is deprecated

  with aws_s3_bucket.history,
  on cdn.tf line 892, in resource "aws_s3_bucket" "history":
 892: resource "aws_s3_bucket" "history" {

Use the aws_s3_bucket_cors_configuration resource instead

(and 2 more similar warnings elsewhere)

Warning: Deprecated Resource

  with aws_s3_bucket_object.lambda,
  on main.tf line 134, in resource "aws_s3_bucket_object" "lambda":
 134: resource "aws_s3_bucket_object" "lambda" {

use the aws_s3_object resource instead
Success! The configuration is valid, but there were some validation warnings
as shown above.

 
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.mqtt: Refreshing state... [id=none]
aws_cloudwatch_event_rule.predict_updater: Refreshing state... [id=predict_updater]
aws_sns_topic.sonde_telem: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:sonde-telem]
aws_sqs_queue.historic_to_s3_dlq: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/update-history-dlq]
aws_apigatewayv2_api.main: Refreshing state... [id=r03szwwq41]
aws_iam_service_linked_role.IAMServiceLinkedRole: Refreshing state... [id=arn:aws:iam::143841941773:role/aws-service-role/es.amazonaws.com/AWSServiceRoleForAmazonElasticsearchService]
aws_s3_bucket.v2: Refreshing state... [id=v2.sondehub.org]
aws_secretsmanager_secret.mqtt: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:143841941773:secret:MQTT-SLWdrF]
aws_ecs_cluster.ws: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:cluster/ws]
aws_appautoscaling_target.tawhiri: Refreshing state... [id=service/Tawhiri/tawhiri]
aws_cloudwatch_event_rule.recovery_ingest: Refreshing state... [id=recovery_ingest]
aws_cognito_user_pool.CognitoUserPool: Refreshing state... [id=us-east-1_G4H7NMniM]
aws_secretsmanager_secret.radiosondy: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:143841941773:secret:RADIOSONDY-nsUVX7]
aws_sqs_queue.ham_sqs_to_elk_dlq: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/ham-to-elk-dlq]
aws_ecs_cluster.tawhiri: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:cluster/Tawhiri]
aws_vpc.main: Refreshing state... [id=vpc-0a0baa77]
aws_acm_certificate.CertificateManagerCertificate: Refreshing state... [id=arn:aws:acm:us-east-1:143841941773:certificate/e2187cc3-6098-4ac9-917e-acd414bdb75e]
aws_s3_bucket.history: Refreshing state... [id=sondehub-history]
aws_cloudwatch_event_rule.ham_predict_updater: Refreshing state... [id=ham_predict_updater]
aws_cloudwatch_log_group.sns_to_mqtt: Refreshing state... [id=/sns_to_mqtt]
aws_s3_bucket.predict: Refreshing state... [id=sondehub-predict]
aws_iam_service_linked_role.IAMServiceLinkedRole3: Refreshing state... [id=arn:aws:iam::143841941773:role/aws-service-role/ops.apigateway.amazonaws.com/AWSServiceRoleForAPIGateway]
aws_s3_bucket.cf_logs: Refreshing state... [id=sondehub-cloudfront-logs]
aws_s3_bucket.predict-testing: Refreshing state... [id=sondehub-predict-testing]
aws_s3_bucket.card: Refreshing state... [id=sondehub-v2-card]
aws_ecr_repository.tawhiri_downloader: Refreshing state... [id=tawhiri-downloader]
aws_cloudwatch_event_rule.history: Refreshing state... [id=history_queue]
aws_ecs_cluster.aprsgw: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:cluster/aprsgw]
aws_cloudwatch_log_group.ignestion: Refreshing state... [id=/ingestion]
aws_sns_topic.ham_telem: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:ham-telem]
aws_sns_topic.ham_listener_telem: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:ham-listener-telem]
aws_s3_bucket.lambda_functions: Refreshing state... [id=terraform-20211220081940015700000001]
aws_ecr_repository.tawhiri: Refreshing state... [id=tawhiri]
aws_sns_topic.listener_telem: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:listener-telem]
aws_acm_certificate.CertificateManagerCertificate_root: Refreshing state... [id=arn:aws:acm:us-east-1:143841941773:certificate/a7da821c-bdbc-404b-aa12-bce28d86cdeb]
aws_route53_zone.Route53HostedZone: Refreshing state... [id=Z0571575V2EX2P3LK16U]
aws_ecr_repository.wsproxy: Refreshing state... [id=wsproxy]
aws_iam_role.IAMRole3: Refreshing state... [id=CognitoAccessForAmazonES]
aws_iam_role.predictor_update_trigger_lambda: Refreshing state... [id=terraform-20211129092010702200000001]
aws_iam_role.ham_predict_updater: Refreshing state... [id=ham-predict-updater]
aws_iam_role.basic_lambda_role: Refreshing state... [id=sonde-api-to-iot-core-role-z9zes3f5]
aws_iam_role.recovered: Refreshing state... [id=recovered]
aws_iam_role.predict_updater: Refreshing state... [id=predict-updater]
aws_iam_role.sqs_to_elk: Refreshing state... [id=sqs-to-elk]
aws_iam_role.ingestion_lambda_role: Refreshing state... [id=sonde-ingestion-20221116012233491700000002]
aws_iam_role.ham_sqs_to_elk: Refreshing state... [id=ham_sqs-to-elk]
aws_iam_role.sign_socket: Refreshing state... [id=sign_socket]
aws_iam_role.historic: Refreshing state... [id=historic]
aws_iam_role.history: Refreshing state... [id=history]
aws_appautoscaling_policy.tawhiri: Refreshing state... [id=cpu]
aws_sqs_queue.historic_to_s3: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/update-history]
aws_ecs_cluster_capacity_providers.ws: Refreshing state... [id=ws]
aws_secretsmanager_secret_version.radiosondy: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:143841941773:secret:RADIOSONDY-nsUVX7|51FBCEA8-C174-449A-BC84-A297CCE6E213]
aws_sqs_queue.ham_sqs_to_elk: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/ham-to-elk]
aws_sqs_queue.sqs_to_elk: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/to-elk]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
aws_ecs_cluster_capacity_providers.tawhiri: Refreshing state... [id=Tawhiri]
aws_ecs_cluster_capacity_providers.aprsgw: Refreshing state... [id=aprsgw]
aws_s3_bucket_policy.S3BucketPolicy: Refreshing state... [id=v2.sondehub.org]
aws_iam_role.aprsgw: Refreshing state... [id=aprsgw]
aws_cognito_user_pool_client.CognitoUserPoolClient: Refreshing state... [id=227g2bbcb2tqjfii1ipt2tj5m6]
aws_iam_role.ws: Refreshing state... [id=ws]
aws_iam_role.ecs_execution: Refreshing state... [id=ecsTaskExecutionRole]
aws_s3_bucket_policy.S3BucketPolicy2: Refreshing state... [id=sondehub-history]
aws_ecs_task_definition.aprsgw: Refreshing state... [id=aprsgw]
aws_s3_bucket_object.lambda: Refreshing state... [id=lambda.zip]
aws_route53_record.cert_validation["*.v2.sondehub.org"]: Refreshing state... [id=Z0571575V2EX2P3LK16U__28c92380155f9c62383c06043dc0656c.v2.sondehub.org_CNAME]
aws_route53_record.ws_reader_CNAME: Refreshing state... [id=Z0571575V2EX2P3LK16U_ws-reader_CNAME]
aws_cloudfront_distribution.predict: Refreshing state... [id=E258SM01Q3NTFC]
aws_route53_record.cert_validation["v2.sondehub.org"]: Refreshing state... [id=Z0571575V2EX2P3LK16U__28c92380155f9c62383c06043dc0656c.v2.sondehub.org_CNAME]
aws_cloudfront_distribution.predict-testing: Refreshing state... [id=EJA1O5LEPQRDX]
aws_cloudfront_distribution.card: Refreshing state... [id=E1U5IIXI87Q160]
aws_iam_role_policy.ingestion_lambda_role: Refreshing state... [id=sonde-ingestion-20221116012233491700000002:terraform-20221116012927186100000001]
aws_iam_role_policy.sqs_to_elk: Refreshing state... [id=sqs-to-elk:sqs_to_elk]
aws_iam_role_policy.ham_predict_updater: Refreshing state... [id=ham-predict-updater:ham_predict_updater]
aws_iam_role_policy.recovered: Refreshing state... [id=recovered:recovered]
aws_sns_topic_subscription.ham_sqs_to_elk: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:ham-telem:ed623df4-92e4-44dd-8048-66a406abf7b8]
aws_iam_role_policy.history: Refreshing state... [id=history:terraform-20210215030637833400000001]
aws_iam_role_policy.predictor_update_trigger_lambda: Refreshing state... [id=terraform-20211129092010702200000001:terraform-20211129092014982100000002]
aws_iam_role_policy.basic_lambda_role: Refreshing state... [id=sonde-api-to-iot-core-role-z9zes3f5:iot]
aws_iam_role_policy.historic: Refreshing state... [id=historic:historic]
aws_iam_role_policy.predict_updater: Refreshing state... [id=predict-updater:predict_updater]
aws_iam_role_policy.ham_sqs_to_elk: Refreshing state... [id=ham_sqs-to-elk:ham_sqs_to_elk]
aws_sns_topic_subscription.sqs_to_elk: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:sonde-telem:1a52ac41-6e17-43da-bfb6-114577c94ca6]
aws_lambda_function.get_sites: Refreshing state... [id=get_sites]
aws_lambda_function.ham_get: Refreshing state... [id=ham_get]
aws_lambda_function.upload_telem: Refreshing state... [id=sonde-api-to-iot-core]
aws_lambda_function.redirect: Refreshing state... [id=sondehub-redirect]
aws_lambda_function.history: Refreshing state... [id=history]
aws_lambda_function.ham_flight_doc_get: Refreshing state... [id=ham-get-flight-doc]
aws_lambda_function.ham_upload_telem: Refreshing state... [id=ham-put-api]
aws_lambda_function.predictions: Refreshing state... [id=predictions]
aws_lambda_function.reverse_predictions: Refreshing state... [id=reverse-predictions]
aws_lambda_function.ham_get_listener_telemetry: Refreshing state... [id=ham_get_listener_telemetry]
aws_lambda_function.get_listener_telemetry: Refreshing state... [id=get_listener_telemetry]
aws_lambda_function.ham_telem: Refreshing state... [id=ham_get_telem]
aws_lambda_function.ham_redirect: Refreshing state... [id=ham-sondehub-redirect]
aws_lambda_function.ham_telem_full: Refreshing state... [id=ham_get_telem_full]
aws_lambda_function.predictor_update_trigger_lambda: Refreshing state... [id=tawhiri-updater]
aws_lambda_function.station: Refreshing state... [id=station-api-to-iot-core]
aws_lambda_function.ham_predictions: Refreshing state... [id=ham_predictions]
aws_lambda_function.get_sondes: Refreshing state... [id=query]
aws_lambda_function.recovery_ingest: Refreshing state... [id=recovery_ingest]
aws_lambda_function.sign_socket: Refreshing state... [id=sign-websocket]
aws_lambda_function.ham_listener_put: Refreshing state... [id=ham-listener-put]
aws_lambda_function.ham_ttn_upload_telem: Refreshing state... [id=ham-ttn-put-api]
aws_lambda_function.ham_helium_upload_telem: Refreshing state... [id=ham-helium-put-api]
aws_lambda_function.tile_counts: Refreshing state... [id=tile_counts]
aws_lambda_function.get_sondes_site: Refreshing state... [id=get_sondes_site]
aws_ecs_task_definition.ws: Refreshing state... [id=ws]
aws_lambda_function.ham_flight_doc: Refreshing state... [id=ham-put-flight-doc]
aws_cognito_identity_pool.CognitoIdentityPool: Refreshing state... [id=us-east-1:55e43eac-9626-43e1-a7d2-bbc57f5f5aa9]
aws_lambda_function.get_telem: Refreshing state... [id=get_telem]
aws_iam_role_policy.s3_config: Refreshing state... [id=ws:s3-config]
aws_security_group.tawhiri_alb: Refreshing state... [id=sg-009775f4b64627830]
aws_lb_target_group.ws_reader: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:targetgroup/ws-reader/505318ab8a79f70b]
aws_lb_target_group.ws: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:targetgroup/ws/deda6fb24618e1bd]
aws_route_table.main: Refreshing state... [id=rtb-0efda81da4e7baf2b]
aws_route_table.public_v6: Refreshing state... [id=rtb-06dacaaedb0d6489f]
aws_security_group.lb: Refreshing state... [id=sg-0425f0e462f849164]
aws_iam_role_policy.aprsgw: Refreshing state... [id=aprsgw:aprsgw]
aws_security_group.vpcendpoint: Refreshing state... [id=sg-012c05d40739db601]
aws_iam_role_policy_attachment.aprsgw: Refreshing state... [id=aprsgw-20220112094238495800000001]
aws_iam_role_policy_attachment.ws: Refreshing state... [id=ws-20211026015558574900000002]
aws_internet_gateway.gw: Refreshing state... [id=igw-b5988cce]
aws_egress_only_internet_gateway.main: Refreshing state... [id=eigw-07166246a33f04b24]
aws_security_group.tawhiri_efs: Refreshing state... [id=sg-0c02c0854e5376885]
aws_sqs_queue_policy.ham_sqs_to_elk: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/ham-to-elk]
aws_subnet.ws_main: Refreshing state... [id=subnet-062e92591b41338d6]
aws_lb_target_group.tawhiri: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:targetgroup/tawhiri/eef603500a548185]
aws_security_group.ws_writer: Refreshing state... [id=sg-09a8e16a347be7a57]
aws_acm_certificate_validation.CertificateManagerCertificate: Refreshing state... [id=2022-11-30 06:39:08.95 +0000 UTC]
aws_sqs_queue_policy.sqs_to_elk: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/143841941773/to-elk]
aws_subnet.public_v6_only["us-east-1e"]: Refreshing state... [id=subnet-09680cc5df211bc5c]
aws_subnet.public_v6_only["us-east-1a"]: Refreshing state... [id=subnet-01e70b3fdd9cceba7]
aws_subnet.public_v6_only["us-east-1b"]: Refreshing state... [id=subnet-0108988240bb64ffa]
aws_subnet.public_v6_only["us-east-1f"]: Refreshing state... [id=subnet-0342d11bb5b826899]
aws_subnet.public_v6_only["us-east-1c"]: Refreshing state... [id=subnet-085d4ba9a1e83c43b]
aws_subnet.public_v6_only["us-east-1d"]: Refreshing state... [id=subnet-05dc261292a65876a]
aws_subnet.public["us-east-1a"]: Refreshing state... [id=subnet-de4ddeff]
aws_subnet.public["us-east-1c"]: Refreshing state... [id=subnet-408d1c1f]
aws_subnet.public["us-east-1f"]: Refreshing state... [id=subnet-204b052e]
aws_subnet.public["us-east-1e"]: Refreshing state... [id=subnet-5c34ec6d]
aws_subnet.public["us-east-1b"]: Refreshing state... [id=subnet-7b1c3836]
aws_subnet.public["us-east-1d"]: Refreshing state... [id=subnet-a7f460c1]
aws_subnet.private_v6_only["us-east-1a"]: Refreshing state... [id=subnet-07283ac6c2c4c0bc4]
aws_subnet.private_v6_only["us-east-1e"]: Refreshing state... [id=subnet-0fd3b4eb0beebfe58]
aws_subnet.private_v6_only["us-east-1d"]: Refreshing state... [id=subnet-033cc13a0a4dc531d]
aws_subnet.private_v6_only["us-east-1b"]: Refreshing state... [id=subnet-0ac78f54bc4fd7751]
aws_subnet.private_v6_only["us-east-1f"]: Refreshing state... [id=subnet-0e2793ad6f9482ea9]
aws_subnet.private_v6_only["us-east-1c"]: Refreshing state... [id=subnet-05b9df5a0a0c38dec]
aws_subnet.private["us-east-1d"]: Refreshing state... [id=subnet-03512eaff0c9442b3]
aws_subnet.private["us-east-1a"]: Refreshing state... [id=subnet-0a3559e6c60534d32]
aws_subnet.private["us-east-1e"]: Refreshing state... [id=subnet-034d5414804d2675f]
aws_subnet.private["us-east-1b"]: Refreshing state... [id=subnet-0896109fa272ce2a5]
aws_subnet.private["us-east-1f"]: Refreshing state... [id=subnet-0da5e895f93b6f106]
aws_subnet.private["us-east-1c"]: Refreshing state... [id=subnet-07308ab971680b901]
aws_iam_role_policy.kms: Refreshing state... [id=ecsTaskExecutionRole:kms]
aws_ecs_task_definition.ws_reader_ec2: Refreshing state... [id=ws_reader_ec2]
aws_iam_role_policy_attachment.ecs_execution: Refreshing state... [id=ecsTaskExecutionRole-20211026015558575000000001]
aws_iam_role_policy.efs: Refreshing state... [id=ecsTaskExecutionRole:EFS]
aws_iam_role_policy.secrets: Refreshing state... [id=ecsTaskExecutionRole:secrests]
aws_iam_role_policy.ssm: Refreshing state... [id=ecsTaskExecutionRole:SSM]
aws_ecs_task_definition.tawhiri: Refreshing state... [id=tawhiri]
aws_route53_record.predict_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_predict_AAAA]
aws_route53_record.predict_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_predict_A]
aws_route53_record.predict_testing_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_predict-testing_A]
aws_route53_record.predict_testing_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_predict-testing_AAAA]
aws_lambda_permission.ham_flight_doc_get: Refreshing state... [id=terraform-20220511091900355200000001]
aws_cloudfront_distribution.sondehub: Refreshing state... [id=E79DTM5JX0RNU]
aws_apigatewayv2_integration.ham_flight_doc_get: Refreshing state... [id=8fbwfx6]
aws_lambda_permission.ham_get_listener_telemetry: Refreshing state... [id=terraform-20220410035700871200000001]
aws_apigatewayv2_integration.ham_get_listener_telemetry: Refreshing state... [id=30jtt73]
aws_cloudfront_distribution.amateur: Refreshing state... [id=E1ILNS33XUZJZO]
aws_lambda_permission.ham_redirect: Refreshing state... [id=terraform-20221104082840565500000001]
aws_apigatewayv2_integration.ham_get: Refreshing state... [id=n7cjhuk]
aws_lambda_permission.ham_get: Refreshing state... [id=terraform-20220226234643734200000001]
aws_lambda_permission.ham_upload_telem: Refreshing state... [id=terraform-20220116222947533100000001]
aws_apigatewayv2_integration.ham_upload_telem: Refreshing state... [id=6b9d42c]
aws_lambda_permission.predictor_update_trigger_lambda: Refreshing state... [id=terraform-20211129092033043900000003]
aws_sns_topic_subscription.predictor_update_trigger_lambda: Refreshing state... [id=arn:aws:sns:us-east-1:123901341784:NewGFSObject:5a9698ec-7a1a-4689-867b-383db19e457a]
aws_apigatewayv2_integration.reverse_predictions: Refreshing state... [id=twwzlck]
aws_lambda_permission.reverse_predictions: Refreshing state... [id=terraform-20211009045533567800000001]
aws_lambda_permission.get_sites: Refreshing state... [id=terraform-20211004105421479600000001]
aws_apigatewayv2_integration.get_sites: Refreshing state... [id=lhog6mf]
aws_lambda_permission.history: Refreshing state... [id=terraform-20210215030703150600000002]
aws_apigatewayv2_integration.history: Refreshing state... [id=66le01p]
aws_lambda_permission.ham_telem_full: Refreshing state... [id=terraform-20220511033126114300000001]
aws_apigatewayv2_integration.ham_telem_full: Refreshing state... [id=hgmqm8l]
aws_apigatewayv2_integration.predictions: Refreshing state... [id=qsw8rmd]
aws_lambda_permission.predictions: Refreshing state... [id=terraform-20210222053152988200000001]
aws_apigatewayv2_integration.upload_telem: Refreshing state... [id=cnw9e24]
aws_lambda_permission.upload_telem: Refreshing state... [id=02a8513f-50e7-5938-9f50-d47a208ea9c4]
aws_lambda_permission.ham_telem: Refreshing state... [id=terraform-20220226234645796200000002]
aws_apigatewayv2_integration.ham_telem: Refreshing state... [id=qxaxvaq]
aws_apigatewayv2_integration.sign_socket: Refreshing state... [id=3z0z19e]
aws_lambda_permission.sign_socket: Refreshing state... [id=terraform-20210201060604212000000001]
aws_lambda_permission.tile_counts: Refreshing state... [id=terraform-20230109024350176900000001]
aws_cloudwatch_event_target.recovery_ingest: Refreshing state... [id=recovery_ingest-recovery_ingest]
aws_apigatewayv2_integration.tile_counts: Refreshing state... [id=risgz40]
aws_lambda_permission.recovery_ingest: Refreshing state... [id=terraform-20220126062338600800000001]
aws_elasticsearch_domain.ElasticsearchDomain: Refreshing state... [id=arn:aws:es:us-east-1:143841941773:domain/sondes-v2-7-9]
aws_lambda_permission.get_sondes_site: Refreshing state... [id=terraform-20230715012703059700000003]
aws_apigatewayv2_integration.get_sondes_site: Refreshing state... [id=gpagzhf]
aws_lambda_permission.sns_to_mqtt: Refreshing state... [id=terraform-20211027235710712300000001]
aws_lambda_permission.station: Refreshing state... [id=terraform-20210401090915325300000001]
aws_apigatewayv2_integration.stations: Refreshing state... [id=mwpzl34]
aws_apigatewayv2_integration.ham_ttn_upload_telem: Refreshing state... [id=a0f9w3a]
aws_lambda_permission.ham_ttn_upload_telem: Refreshing state... [id=terraform-20231010213627891400000003]
aws_lambda_permission.ham_flight_doc: Refreshing state... [id=terraform-20220510225006354100000002]
aws_apigatewayv2_integration.ham_flight_doc: Refreshing state... [id=xbgov6h]
aws_apigatewayv2_integration.ham_predictions: Refreshing state... [id=v0bac0g]
aws_lambda_permission.ham_predictions: Refreshing state... [id=terraform-20220409020828193200000001]
aws_security_group.tawhiri: Refreshing state... [id=sg-006470b1ebfd4a08c]
aws_route.main: Refreshing state... [id=r-rtb-0efda81da4e7baf2b1080289494]
aws_vpc_endpoint.secretsmanager: Refreshing state... [id=vpce-09414743190e9f423]
aws_route.public: Refreshing state... [id=r-rtb-06dacaaedb0d6489f1080289494]
aws_route.public_v6: Refreshing state... [id=r-rtb-06dacaaedb0d6489f2750132062]
aws_route.main6: Refreshing state... [id=r-rtb-0efda81da4e7baf2b2750132062]
aws_apigatewayv2_integration.ham_helium_upload_telem: Refreshing state... [id=pbjmn55]
aws_lambda_permission.ham_helium_upload_telem: Refreshing state... [id=terraform-20230824083532815000000002]
aws_network_interface.ws_pad[0]: Refreshing state... [id=eni-0da878f06d90dcde9]
aws_network_interface.ws_pad[6]: Refreshing state... [id=eni-069ebf56c9e4fdd7f]
aws_network_interface.ws_pad[5]: Refreshing state... [id=eni-0776494ae4f908042]
aws_network_interface.ws_pad[7]: Refreshing state... [id=eni-054a9210306259e1b]
aws_network_interface.ws_pad[3]: Refreshing state... [id=eni-0d40407d608d35e38]
aws_network_interface.ws_pad[4]: Refreshing state... [id=eni-01e4afb86960a27cf]
aws_network_interface.ws_pad[8]: Refreshing state... [id=eni-07c92d00c031482ec]
aws_network_interface.ws_pad[1]: Refreshing state... [id=eni-0d808bd7acad70c66]
aws_network_interface.ws_pad[2]: Refreshing state... [id=eni-0ddc45ce32abb4a58]
aws_route_table_association.ws_main: Refreshing state... [id=rtbassoc-021c8735f65874b12]
aws_security_group.ws_reader: Refreshing state... [id=sg-05f795128b295c504]
aws_ecs_service.ws_writer: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:service/ws/ws-writer]
aws_security_group_rule.ws_writer_lb: Refreshing state... [id=sgrule-71149243]
aws_security_group_rule.ws_writer_lightsail_lb: Refreshing state... [id=sgrule-3510979606]
aws_cloudfront_distribution.testing: Refreshing state... [id=E1899XF5PNG0C7]
aws_apigatewayv2_domain_name.ApiGatewayV2DomainName: Refreshing state... [id=api-raw.v2.sondehub.org]
aws_cognito_user_pool_domain.main: Refreshing state... [id=auth.v2.sondehub.org]
aws_route_table_association.public_v6_only["us-east-1c"]: Refreshing state... [id=rtbassoc-0fcb0423d77336e93]
aws_route_table_association.public_v6_only["us-east-1a"]: Refreshing state... [id=rtbassoc-0b05baa5db2def28f]
aws_route_table_association.public_v6_only["us-east-1b"]: Refreshing state... [id=rtbassoc-0cbe89e9ed15f2270]
aws_route_table_association.public_v6_only["us-east-1e"]: Refreshing state... [id=rtbassoc-02dcb28a251edb1c0]
aws_route_table_association.public_v6_only["us-east-1d"]: Refreshing state... [id=rtbassoc-080100c29293577d8]
aws_route_table_association.public_v6_only["us-east-1f"]: Refreshing state... [id=rtbassoc-09e40555dc78e682b]
aws_ecs_service.aprsgw: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:service/aprsgw/aprsgw]
aws_route_table_association.public["us-east-1c"]: Refreshing state... [id=rtbassoc-0162d2bdeeda409ce]
aws_route_table_association.public["us-east-1a"]: Refreshing state... [id=rtbassoc-0c92954c05a13c400]
aws_route_table_association.public["us-east-1b"]: Refreshing state... [id=rtbassoc-06982a901f7760a29]
aws_route_table_association.public["us-east-1e"]: Refreshing state... [id=rtbassoc-0502665986533b2d0]
aws_route_table_association.public["us-east-1f"]: Refreshing state... [id=rtbassoc-0006355ff9b29d81f]
aws_route_table_association.public["us-east-1d"]: Refreshing state... [id=rtbassoc-05f4e664ed5521898]
aws_lb.ws: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:loadbalancer/app/ws/d29968044c69f0da]
aws_route_table_association.private_v6_only["us-east-1d"]: Refreshing state... [id=rtbassoc-0b8b456fa4e728e6a]
aws_route_table_association.private_v6_only["us-east-1e"]: Refreshing state... [id=rtbassoc-09c044a274e2326bd]
aws_route_table_association.private_v6_only["us-east-1b"]: Refreshing state... [id=rtbassoc-09ccb4ea1c993a48e]
aws_route_table_association.private_v6_only["us-east-1f"]: Refreshing state... [id=rtbassoc-00efa5a1f1f364263]
aws_route_table_association.private_v6_only["us-east-1a"]: Refreshing state... [id=rtbassoc-04cf4ac6fd2ec8eaa]
aws_route_table_association.private_v6_only["us-east-1c"]: Refreshing state... [id=rtbassoc-0e889df2e063723a0]
aws_ecs_service.ws_reader_ec2: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:service/ws/ws-reader-ec2]
aws_lambda_function.sns_to_mqtt_listener: Refreshing state... [id=sns-to-mqtt-listener]
aws_lambda_function.ham_sns_to_mqtt_listener: Refreshing state... [id=ham-sns-to-mqtt-listener]
aws_lambda_function.ham_sns_to_mqtt: Refreshing state... [id=ham-sns-to-mqtt]
aws_route_table_association.private["us-east-1f"]: Refreshing state... [id=rtbassoc-0f9985420e6d42686]
aws_route_table_association.private["us-east-1b"]: Refreshing state... [id=rtbassoc-0c0159705bf0df21a]
aws_route_table_association.private["us-east-1a"]: Refreshing state... [id=rtbassoc-0c03b064cbe58bb27]
aws_route_table_association.private["us-east-1d"]: Refreshing state... [id=rtbassoc-0f6ddbb66ac06b1fb]
aws_route_table_association.private["us-east-1e"]: Refreshing state... [id=rtbassoc-07e1e368e5fb6fbcd]
aws_route_table_association.private["us-east-1c"]: Refreshing state... [id=rtbassoc-05bf1c64dde7d3001]
aws_lambda_function.sns_to_mqtt: Refreshing state... [id=sns-to-mqtt]
aws_apigatewayv2_route.ham_flight_doc_get: Refreshing state... [id=8qn64jp]
aws_route53_record.www_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_www_AAAA]
aws_route53_record.tracker_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_tracker_A]
aws_route53_record.v2_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U__AAAA]
aws_route53_record.root_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S__AAAA]
aws_route53_record.www_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_www_A]
aws_route53_record.root_A: Refreshing state... [id=Z0756308IVLVF48G6G1S__A]
aws_route53_record.v2_A: Refreshing state... [id=Z0571575V2EX2P3LK16U__A]
aws_route53_record.tracker_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_tracker_AAAA]
aws_apigatewayv2_route.ham_get_listener_telemetry: Refreshing state... [id=rhsyczp]
aws_apigatewayv2_route.ham_get: Refreshing state... [id=v90ren0]
aws_apigatewayv2_route.ham_upload_telem: Refreshing state... [id=gkhgene]
aws_route53_record.ham_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_ham_A]
aws_route53_record.ham_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_ham_AAAA]
aws_route53_record.amateur_A: Refreshing state... [id=Z0756308IVLVF48G6G1S_amateur_A]
aws_route53_record.amateur_AAAA: Refreshing state... [id=Z0756308IVLVF48G6G1S_amateur_AAAA]
aws_apigatewayv2_route.reverse_predictions: Refreshing state... [id=r9jwvbm]
aws_apigatewayv2_route.get_sites: Refreshing state... [id=pzuni2l]
aws_apigatewayv2_route.history: Refreshing state... [id=wytcqsn]
aws_apigatewayv2_route.ham_telem_full: Refreshing state... [id=bsjk3xo]
aws_apigatewayv2_route.predictions: Refreshing state... [id=s9z3t7t]
aws_apigatewayv2_route.upload_telem: Refreshing state... [id=ps2g60b]
aws_iam_role.unauth_role: Refreshing state... [id=Cognito_sondesUnauth_Role]
aws_iam_role.auth_role: Refreshing state... [id=Cognito_sondesAuth_Role]
aws_apigatewayv2_route.sign_socket: Refreshing state... [id=q5dgv70]
aws_apigatewayv2_route.ham_telem: Refreshing state... [id=xhkgm6t]
aws_apigatewayv2_integration.get_telem: Refreshing state... [id=jimf7df]
aws_lambda_permission.get_telem: Refreshing state... [id=terraform-20210202103643622900000001]
aws_apigatewayv2_route.tile_counts: Refreshing state... [id=04vgyqu]
aws_apigatewayv2_route.get_sondes_site: Refreshing state... [id=nwbbgdj]
aws_apigatewayv2_route.stations: Refreshing state... [id=mdkjsnl]
aws_apigatewayv2_route.ham_ttn_upload_telem: Refreshing state... [id=3gtgf67]
aws_apigatewayv2_route.ham_flight_doc: Refreshing state... [id=89i7rgv]
aws_apigatewayv2_route.ham_predictions: Refreshing state... [id=a2vdjm3]
aws_ecs_service.tawhiri: Refreshing state... [id=arn:aws:ecs:us-east-1:143841941773:service/Tawhiri/tawhiri]
aws_apigatewayv2_route.ham_helium_upload_telem: Refreshing state... [id=22bgh2i]
aws_route53_record.es: Refreshing state... [id=Z0571575V2EX2P3LK16U_es_CNAME]
aws_security_group_rule.ws_writer_reader: Refreshing state... [id=sgrule-4271061801]
aws_route53_record.auth["A"]: Refreshing state... [id=Z0571575V2EX2P3LK16U_auth_A]
aws_route53_record.auth["AAAA"]: Refreshing state... [id=Z0571575V2EX2P3LK16U_auth_AAAA]
aws_route53_record.api_raw: Refreshing state... [id=Z0571575V2EX2P3LK16U_api-raw_CNAME]
aws_cloudfront_distribution.api: Refreshing state... [id=E3KEBAPY1913GO]
aws_apigatewayv2_api_mapping.ApiGatewayV2ApiMapping: Refreshing state... [id=lkd9wl]
aws_route53_record.testing_A: Refreshing state... [id=Z0571575V2EX2P3LK16U_testing_A]
aws_route53_record.testing_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U_testing_AAAA]
aws_route53_record.tawhiri_A: Refreshing state... [id=Z0571575V2EX2P3LK16U_tawhiri_A]
aws_route53_record.ws_A: Refreshing state... [id=Z0571575V2EX2P3LK16U_ws_A]
aws_lb_listener.lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:listener/app/ws/d29968044c69f0da/320139c9e787f8ac]
aws_route53_record.ws_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U_ws_AAAA]
aws_apigatewayv2_integration.get_listener_telemetry: Refreshing state... [id=ab3t2lo]
aws_route53_record.tawhiri_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U_tawhiri_AAAA]
aws_lambda_permission.get_listener_telemetry: Refreshing state... [id=terraform-20210721094823635000000001]
aws_sns_topic_subscription.ham_listener_telem: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:ham-listener-telem:b38ae447-791e-468a-9701-e53f84281b32]
aws_lambda_permission.ham_sns_to_mqtt_listener: Refreshing state... [id=terraform-20220918012926645300000001]
aws_sns_topic_subscription.sns_to_mqtt_listener: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:listener-telem:58a11f0a-7755-4698-9471-afaadc218c9f]
aws_lambda_permission.sns_to_mqtt_listener: Refreshing state... [id=terraform-20220918012926646600000002]
aws_lambda_permission.get_sondes: Refreshing state... [id=terraform-20210202070651842200000001]
aws_apigatewayv2_integration.get_sondes: Refreshing state... [id=6ukw9c9]
aws_secretsmanager_secret_version.mqtt: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:143841941773:secret:MQTT-SLWdrF|B825B61A-292B-4A38-AD8F-C527C812375D]
aws_apigatewayv2_route.get_telem: Refreshing state... [id=6y7jyfq]
aws_iam_role_policy.IAMPolicy2: Refreshing state... [id=Cognito_sondesUnauth_Role:oneClick_Cognito_sondesUnauth_Role_1611905520139]
aws_sns_topic_subscription.ham_sns_to_mqtt: Refreshing state... [id=arn:aws:sns:us-east-1:143841941773:ham-telem:c3cdaafd-a2de-43d8-b699-bee70c267479]
aws_lambda_permission.ham_sns_to_mqtt: Refreshing state... [id=terraform-20220116225823799600000001]
aws_iam_role_policy.IAMPolicy4: Refreshing state... [id=Cognito_sondesAuth_Role:terraform-20220510224633261000000001]
aws_iam_role_policy.IAMPolicy3: Refreshing state... [id=Cognito_sondesAuth_Role:oneClick_Cognito_sondesAuth_Role_1611905520138]
aws_iam_role_policy.IAMPolicy: Refreshing state... [id=Cognito_sondesAuth_Role:sondes-v2]
aws_lambda_function.ham_sqs_to_elk: Refreshing state... [id=ham-sqs-to-elk]
aws_cognito_identity_pool_roles_attachment.CognitoIdentityPoolRoleAttachment: Refreshing state... [id=us-east-1:55e43eac-9626-43e1-a7d2-bbc57f5f5aa9]
aws_lambda_function.ham_predict_updater: Refreshing state... [id=ham_predict_updater]
aws_lambda_function.predict_updater: Refreshing state... [id=predict_updater]
aws_lambda_function.recovered_stats: Refreshing state... [id=recovered_stats]
aws_lambda_function.sqs_to_elk: Refreshing state... [id=sqs-to-elk]
aws_lambda_function.recovered_get: Refreshing state... [id=recovered_get]
aws_lambda_function.queue_data_update: Refreshing state... [id=queue_data_update]
aws_lambda_function.recovered_put: Refreshing state... [id=recovered_put]
aws_lambda_function.historic_to_s3: Refreshing state... [id=historic_to_s3]
aws_route53_record.api_AAAA: Refreshing state... [id=Z0571575V2EX2P3LK16U_api_AAAA]
aws_route53_record.api_A: Refreshing state... [id=Z0571575V2EX2P3LK16U_api_A]
aws_lb_listener_rule.tawhiri: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:143841941773:listener-rule/app/ws/d29968044c69f0da/320139c9e787f8ac/43f26c3ee3077d14]
aws_apigatewayv2_route.get_listener_telemetry: Refreshing state... [id=wcyj71b]
aws_apigatewayv2_route.get_sondes: Refreshing state... [id=6eghzch]
aws_cloudwatch_event_target.ham_predict_updater: Refreshing state... [id=ham_predict_updater-SendToLambda]
aws_lambda_permission.ham_predict_updater: Refreshing state... [id=terraform-20220409025447509800000001]
aws_apigatewayv2_integration.ham_listener_put: Refreshing state... [id=ptca7vq]
aws_lambda_permission.ham_listener_put: Refreshing state... [id=terraform-20220227022754058900000001]
aws_lambda_event_source_mapping.ham_sqs_to_elk: Refreshing state... [id=df4d2334-34e3-4cda-bb38-83d0d10d7dcf]
aws_apigatewayv2_integration.recovered_get: Refreshing state... [id=8xxwvem]
aws_lambda_permission.recovered_get: Refreshing state... [id=terraform-20210606010548494800000002]
aws_lambda_event_source_mapping.sqs_to_elk: Refreshing state... [id=33b4ab9d-4977-43e7-a994-dc90290ff9b9]
aws_cloudwatch_event_target.sns: Refreshing state... [id=history_queue-SendToLambda]
aws_lambda_permission.history_cron: Refreshing state... [id=terraform-20210802123205008600000001]
aws_apigatewayv2_integration.recovered_put: Refreshing state... [id=hdkf78r]
aws_lambda_permission.recovered_put: Refreshing state... [id=terraform-20210606010536710300000001]
aws_lambda_permission.recovered_stats: Refreshing state... [id=terraform-20211220010615406300000001]
aws_apigatewayv2_integration.recovered_stats: Refreshing state... [id=ss8ukvb]
aws_apigatewayv2_route.ham_listener_put: Refreshing state... [id=1f13y15]
aws_apigatewayv2_route.recovered_get: Refreshing state... [id=eysilfn]
aws_lambda_permission.predict_updater: Refreshing state... [id=terraform-20210913041550353600000001]
aws_cloudwatch_event_target.predict_updater: Refreshing state... [id=predict_updater-SendToLambda]
aws_apigatewayv2_route.recovered_put: Refreshing state... [id=e88oqzm]
aws_apigatewayv2_route.recovered_stats: Refreshing state... [id=ad6q4bt]
aws_lambda_event_source_mapping.historic_to_s3: Refreshing state... [id=5bb8546b-2e64-4bf2-aae1-b94c6337e4e8]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_cognito_user_pool.CognitoUserPool has changed
  ~ resource "aws_cognito_user_pool" "CognitoUserPool" {
      ~ estimated_number_of_users  = 1678 -> 1746
        id                         = "us-east-1_G4H7NMniM"
        name                       = "sondes"
        tags                       = {}
        # (16 unchanged attributes hidden)








        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.amateur will be updated in-place
  ~ resource "aws_cloudfront_distribution" "amateur" {
        id                             = "E1ILNS33XUZJZO"
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "viewer-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:143841941773:function:ham-sondehub-redirect:60" -> null
            }
          + lambda_function_association {
              + event_type   = "viewer-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }




        # (4 unchanged blocks hidden)
    }

  # aws_cloudfront_distribution.sondehub will be updated in-place
  ~ resource "aws_cloudfront_distribution" "sondehub" {
        id                             = "E79DTM5JX0RNU"
        tags                           = {}
        # (20 unchanged attributes hidden)


      ~ default_cache_behavior {
            # (11 unchanged attributes hidden)


          - lambda_function_association {
              - event_type   = "viewer-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:143841941773:function:sondehub-redirect:65" -> null
            }
          + lambda_function_association {
              + event_type   = "viewer-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
            # (1 unchanged block hidden)
        }




        # (11 unchanged blocks hidden)
    }

  # aws_lambda_function.get_listener_telemetry will be updated in-place
  ~ resource "aws_lambda_function" "get_listener_telemetry" {
        id                             = "get_listener_telemetry"
      ~ last_modified                  = "2024-05-19T07:48:24.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:get_listener_telemetry:151" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:get_listener_telemetry:151/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "get_listener_telemetry"
        }
      ~ version                        = "151" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.get_sites will be updated in-place
  ~ resource "aws_lambda_function" "get_sites" {
        id                             = "get_sites"
      ~ last_modified                  = "2024-05-19T07:48:30.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:get_sites:143" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:get_sites:143/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "get_sites"
        }
      ~ version                        = "143" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.get_sondes will be updated in-place
  ~ resource "aws_lambda_function" "get_sondes" {
        id                             = "query"
      ~ last_modified                  = "2024-05-19T07:47:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:query:196" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:query:196/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "query"
        }
      ~ version                        = "196" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.get_sondes_site will be updated in-place
  ~ resource "aws_lambda_function" "get_sondes_site" {
        id                             = "get_sondes_site"
      ~ last_modified                  = "2024-05-19T07:47:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:get_sondes_site:22" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:get_sondes_site:22/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "get_sondes_site"
        }
      ~ version                        = "22" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.get_telem will be updated in-place
  ~ resource "aws_lambda_function" "get_telem" {
        id                             = "get_telem"
      ~ last_modified                  = "2024-05-19T07:48:24.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:get_telem:206" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:get_telem:206/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "get_telem"
        }
      ~ version                        = "206" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_flight_doc will be updated in-place
  ~ resource "aws_lambda_function" "ham_flight_doc" {
        id                             = "ham-put-flight-doc"
      ~ last_modified                  = "2024-05-19T07:48:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-put-flight-doc:75" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham-put-flight-doc:75/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {}
      ~ version                        = "75" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_flight_doc_get will be updated in-place
  ~ resource "aws_lambda_function" "ham_flight_doc_get" {
        id                             = "ham-get-flight-doc"
      ~ last_modified                  = "2024-05-19T07:48:23.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-get-flight-doc:70" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham-get-flight-doc:70/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {}
      ~ version                        = "70" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_get will be updated in-place
  ~ resource "aws_lambda_function" "ham_get" {
        id                             = "ham_get"
      ~ last_modified                  = "2024-05-19T07:47:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham_get:101" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham_get:101/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "ham_get"
        }
      ~ version                        = "101" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_get_listener_telemetry will be updated in-place
  ~ resource "aws_lambda_function" "ham_get_listener_telemetry" {
        id                             = "ham_get_listener_telemetry"
      ~ last_modified                  = "2024-05-19T07:48:12.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham_get_listener_telemetry:82" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham_get_listener_telemetry:82/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "ham_get_listener_telemetry"
        }
      ~ version                        = "82" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_helium_upload_telem will be updated in-place
  ~ resource "aws_lambda_function" "ham_helium_upload_telem" {
        id                             = "ham-helium-put-api"
      ~ last_modified                  = "2024-05-25T10:35:26.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-helium-put-api:22" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham-helium-put-api:22/invocations" -> (known after apply)
      ~ source_code_hash               = "urSrPyjavzMzTQWo7+sGE6FXkJM2wVdFC4y2Q5nTUgs=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {}
      ~ version                        = "22" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_listener_put will be updated in-place
  ~ resource "aws_lambda_function" "ham_listener_put" {
        id                             = "ham-listener-put"
      ~ last_modified                  = "2024-05-19T07:48:12.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-listener-put:97" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham-listener-put:97/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "ham-listener-put"
        }
      ~ version                        = "97" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_predict_updater will be updated in-place
  ~ resource "aws_lambda_function" "ham_predict_updater" {
        id                             = "ham_predict_updater"
      ~ last_modified                  = "2024-05-19T07:48:12.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham_predict_updater:86" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham_predict_updater:86/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "ham_predict_updater"
        }
      ~ version                        = "86" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_predictions will be updated in-place
  ~ resource "aws_lambda_function" "ham_predictions" {
        id                             = "ham_predictions"
      ~ last_modified                  = "2024-05-19T07:48:14.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham_predictions:84" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham_predictions:84/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "ham_predictions"
        }
      ~ version                        = "84" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_redirect will be updated in-place
  ~ resource "aws_lambda_function" "ham_redirect" {
        id                             = "ham-sondehub-redirect"
      ~ last_modified                  = "2024-05-19T07:47:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-sondehub-redirect:60" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham-sondehub-redirect:60/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {}
      ~ version                        = "60" -> (known after apply)
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_sns_to_mqtt will be updated in-place
  ~ resource "aws_lambda_function" "ham_sns_to_mqtt" {
        id                             = "ham-sns-to-mqtt"
      ~ last_modified                  = "2024-05-19T07:48:14.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-sns-to-mqtt:119" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham-sns-to-mqtt:119/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "sns-to-mqtt"
        }
      ~ version                        = "119" -> (known after apply)
        # (18 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_sns_to_mqtt_listener will be updated in-place
  ~ resource "aws_lambda_function" "ham_sns_to_mqtt_listener" {
        id                             = "ham-sns-to-mqtt-listener"
      ~ last_modified                  = "2024-05-19T07:48:30.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-sns-to-mqtt-listener:63" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham-sns-to-mqtt-listener:63/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "sns-to-mqtt"
        }
      ~ version                        = "63" -> (known after apply)
        # (18 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_sqs_to_elk will be updated in-place
  ~ resource "aws_lambda_function" "ham_sqs_to_elk" {
        id                             = "ham-sqs-to-elk"
      ~ last_modified                  = "2024-05-19T07:48:12.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-sqs-to-elk:122" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham-sqs-to-elk:122/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "ham_sqs_to_elk"
        }
      ~ version                        = "122" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_telem will be updated in-place
  ~ resource "aws_lambda_function" "ham_telem" {
        id                             = "ham_get_telem"
      ~ last_modified                  = "2024-05-19T07:48:29.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham_get_telem:106" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham_get_telem:106/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "ham_get_telem"
        }
      ~ version                        = "106" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_telem_full will be updated in-place
  ~ resource "aws_lambda_function" "ham_telem_full" {
        id                             = "ham_get_telem_full"
      ~ last_modified                  = "2024-05-19T07:48:24.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham_get_telem_full:71" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham_get_telem_full:71/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "ham_get_telem_full"
        }
      ~ version                        = "71" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_ttn_upload_telem will be updated in-place
  ~ resource "aws_lambda_function" "ham_ttn_upload_telem" {
        id                             = "ham-ttn-put-api"
      ~ last_modified                  = "2024-05-25T10:35:26.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-ttn-put-api:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham-ttn-put-api:18/invocations" -> (known after apply)
      ~ source_code_hash               = "urSrPyjavzMzTQWo7+sGE6FXkJM2wVdFC4y2Q5nTUgs=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {}
      ~ version                        = "18" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.ham_upload_telem will be updated in-place
  ~ resource "aws_lambda_function" "ham_upload_telem" {
        id                             = "ham-put-api"
      ~ last_modified                  = "2024-05-19T07:48:21.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:ham-put-api:120" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:ham-put-api:120/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {}
      ~ version                        = "120" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.historic_to_s3 will be updated in-place
  ~ resource "aws_lambda_function" "historic_to_s3" {
        id                             = "historic_to_s3"
      ~ last_modified                  = "2024-05-19T07:48:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:historic_to_s3:157" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:historic_to_s3:157/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "historic_to_s3"
        }
      ~ version                        = "157" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.history will be updated in-place
  ~ resource "aws_lambda_function" "history" {
        id                             = "history"
      ~ last_modified                  = "2024-05-19T07:48:24.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:history:154" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:history:154/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "history"
        }
      ~ version                        = "154" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.predict_updater will be updated in-place
  ~ resource "aws_lambda_function" "predict_updater" {
        id                             = "predict_updater"
      ~ last_modified                  = "2024-05-19T07:48:13.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:predict_updater:155" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:predict_updater:155/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "predict_updater"
        }
      ~ version                        = "155" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.predictions will be updated in-place
  ~ resource "aws_lambda_function" "predictions" {
        id                             = "predictions"
      ~ last_modified                  = "2024-05-19T07:47:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:predictions:179" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:predictions:179/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "predictions"
        }
      ~ version                        = "179" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.predictor_update_trigger_lambda will be updated in-place
  ~ resource "aws_lambda_function" "predictor_update_trigger_lambda" {
        id                             = "tawhiri-updater"
      ~ last_modified                  = "2024-05-19T07:48:14.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:tawhiri-updater:140" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:tawhiri-updater:140/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "tawhiri-updater"
        }
      ~ version                        = "140" -> (known after apply)
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.queue_data_update will be updated in-place
  ~ resource "aws_lambda_function" "queue_data_update" {
        id                             = "queue_data_update"
      ~ last_modified                  = "2024-05-19T07:48:31.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:queue_data_update:145" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:queue_data_update:145/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "queue_data_update"
        }
      ~ version                        = "145" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.recovered_get will be updated in-place
  ~ resource "aws_lambda_function" "recovered_get" {
        id                             = "recovered_get"
      ~ last_modified                  = "2024-05-19T07:48:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:recovered_get:147" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:recovered_get:147/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "recovered_get"
        }
      ~ version                        = "147" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.recovered_put will be updated in-place
  ~ resource "aws_lambda_function" "recovered_put" {
        id                             = "recovered_put"
      ~ last_modified                  = "2024-05-19T07:48:13.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:recovered_put:147" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:recovered_put:147/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "recovered_put"
        }
      ~ version                        = "147" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.recovered_stats will be updated in-place
  ~ resource "aws_lambda_function" "recovered_stats" {
        id                             = "recovered_stats"
      ~ last_modified                  = "2024-05-19T07:48:21.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:recovered_stats:137" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:recovered_stats:137/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "recovered_stats"
        }
      ~ version                        = "137" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.recovery_ingest will be updated in-place
  ~ resource "aws_lambda_function" "recovery_ingest" {
        id                             = "recovery_ingest"
      ~ last_modified                  = "2024-05-19T07:48:33.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:recovery_ingest:113" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:recovery_ingest:113/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "recovered_get"
        }
      ~ version                        = "113" -> (known after apply)
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.redirect will be updated in-place
  ~ resource "aws_lambda_function" "redirect" {
        id                             = "sondehub-redirect"
      ~ last_modified                  = "2024-05-19T07:47:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:sondehub-redirect:65" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:sondehub-redirect:65/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {}
      ~ version                        = "65" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.reverse_predictions will be updated in-place
  ~ resource "aws_lambda_function" "reverse_predictions" {
        id                             = "reverse-predictions"
      ~ last_modified                  = "2024-05-19T07:48:24.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:reverse-predictions:141" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:reverse-predictions:141/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "reverse_predictions"
        }
      ~ version                        = "141" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.sign_socket will be updated in-place
  ~ resource "aws_lambda_function" "sign_socket" {
        id                             = "sign-websocket"
      ~ last_modified                  = "2024-05-19T07:48:34.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:sign-websocket:141" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:sign-websocket:141/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {}
      ~ version                        = "141" -> (known after apply)
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.sns_to_mqtt will be updated in-place
  ~ resource "aws_lambda_function" "sns_to_mqtt" {
        id                             = "sns-to-mqtt"
      ~ last_modified                  = "2024-05-19T07:48:14.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:sns-to-mqtt:121" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:sns-to-mqtt:121/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "sns-to-mqtt"
        }
      ~ version                        = "121" -> (known after apply)
        # (18 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.sns_to_mqtt_listener will be updated in-place
  ~ resource "aws_lambda_function" "sns_to_mqtt_listener" {
        id                             = "sns-to-mqtt-listener"
      ~ last_modified                  = "2024-05-19T07:48:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:sns-to-mqtt-listener:63" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:sns-to-mqtt-listener:63/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "sns-to-mqtt"
        }
      ~ version                        = "63" -> (known after apply)
        # (18 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.sqs_to_elk will be updated in-place
  ~ resource "aws_lambda_function" "sqs_to_elk" {
        id                             = "sqs-to-elk"
      ~ last_modified                  = "2024-05-19T07:47:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:sqs-to-elk:153" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:sqs-to-elk:153/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "sqs_to_elk"
        }
      ~ version                        = "153" -> (known after apply)
        # (18 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.station will be updated in-place
  ~ resource "aws_lambda_function" "station" {
        id                             = "station-api-to-iot-core"
      ~ last_modified                  = "2024-05-19T07:48:21.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:station-api-to-iot-core:151" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:station-api-to-iot-core:151/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {
            "Name" = "station-api-to-iot-core"
        }
      ~ version                        = "151" -> (known after apply)
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.tile_counts will be updated in-place
  ~ resource "aws_lambda_function" "tile_counts" {
        id                             = "tile_counts"
      ~ last_modified                  = "2024-05-19T07:48:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:tile_counts:44" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:tile_counts:44/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {}
      ~ version                        = "44" -> (known after apply)
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.upload_telem will be updated in-place
  ~ resource "aws_lambda_function" "upload_telem" {
        id                             = "sonde-api-to-iot-core"
      ~ last_modified                  = "2024-05-19T07:47:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:143841941773:function:sonde-api-to-iot-core:199" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:143841941773:function:sonde-api-to-iot-core:199/invocations" -> (known after apply)
      ~ source_code_hash               = "YfGbuPQQD3XN0V+ygKZ6B4OoLoCF1lBYu77ULzI/eKI=" -> "efKAJEbaeKMXrjZZc1eGpV8HifbpUNKeaz63jl3Q8PE="
        tags                           = {}
      ~ version                        = "199" -> (known after apply)
        # (18 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.lambda will be updated in-place
  ~ resource "aws_s3_bucket_object" "lambda" {
      ~ etag                   = "7119f10d91aa5c8069bb26b219970201" -> "da7117f07828fd7073596c6986f919fb"
        id                     = "lambda.zip"
        tags                   = {}
      ~ version_id             = "gY6W.yr6s03Bjz6IbZzsrQj49GHx5ad9" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 0 to add, 43 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.history,
  on cdn.tf line 892, in resource "aws_s3_bucket" "history":
 892: resource "aws_s3_bucket" "history" {

Use the aws_s3_bucket_cors_configuration resource instead

(and 6 more similar warnings elsewhere)

Warning: Deprecated Resource

  with aws_s3_bucket_object.lambda,
  on main.tf line 134, in resource "aws_s3_bucket_object" "lambda":
 134: resource "aws_s3_bucket_object" "lambda" {

use the aws_s3_object resource instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: prod.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "prod.plan"

```

</details>

*Pusher: @darksidelemm, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*